# index 다루기
- 특정 컬럼을 인덱스 설정
- 기존 인덱스에 새로 추가하는 경우
- 0-base 인덱스로 리셋하는 경우

In [59]:
import pandas as pd

In [60]:
exam_data = {
    "이름": ["인욱", "서준", "동석"],
    "수학": [90, 80, 70],
    "국어": [100, 91, 77],
    "영어": [80, 85, 97],
    "음악": [95, 85, 66],
}
df = pd.DataFrame(exam_data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   수학      3 non-null      int64
 2   국어      3 non-null      int64
 3   영어      3 non-null      int64
 4   음악      3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes

In [61]:
# df의 속성 읽기 => index, columns, shape
df

   이름  수학   국어  영어  음악
0  인욱  90  100  80  95
1  서준  80   91  85  85
2  동석  70   77  97  66

In [62]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [63]:
df.columns

Index(['이름', '수학', '국어', '영어', '음악'], dtype='object')

In [64]:
df.shape

(3, 5)

## 특정 컬럼을 인덱스 설정 => 중복
- 조건 : 중복 / NaN (Nat a Number) : 빈칸의미
- 생성 : df.set_index('컬럼명', inplace=False) <- 기본값
        df,set_index(['컬럼명', '컬럼명'], inplace=False)

In [65]:
# 이름 컬럼 => 행 인덱스 설정
df.set_index("이름", inplace=True)

In [66]:
df.index

Index(['인욱', '서준', '동석'], dtype='object', name='이름')

## 인덱스 초기화(리셋)
- 기존의 인덱스 => 컬럼 돌려주기
- 메서드 : df.reset_index(inplace=False)

In [67]:
df.reset_index(inplace=True)

In [69]:
df

   이름  수학   국어  영어  음악
0  인욱  90  100  80  95
1  서준  80   91  85  85
2  동석  70   77  97  66

In [71]:
# 행 추가하기
df.loc[3] = ["동석", 80, 50, 20, 77]
df

   이름  수학   국어  영어  음악
0  인욱  90  100  80  95
1  서준  80   91  85  85
2  동석  70   77  97  66
3  동석  80   50  20  77

In [76]:
# 특정 컬럼 인덱스로 설정
df2 = df.set_index(["이름", "수학"])
df2

        국어  영어  음악
이름 수학
인욱 90  100  80  95
서준 80   91  85  85
동석 70   77  97  66
   80   50  20  77

## 인덱스 재배열 설정
- 기존 인덱스를 변경하는것
- 원본 적용 inplace - False 기본값
- 메서드 : df.reindex([인덱스리스트], fill_value=값)

In [84]:
df

   이름  수학   국어  영어  음악
0  인욱  90  100  80  95
1  서준  80   91  85  85
2  동석  70   77  97  66
3  동석  80   50  20  77

In [80]:
df1 = df.reindex([0, 1, 2, 3, 4, 5], fill_value=0)
df1

   이름  수학   국어  영어  음악
0  인욱  90  100  80  95
1  서준  80   91  85  85
2  동석  70   77  97  66
3  동석  80   50  20  77
4   0   0    0   0   0
5   0   0    0   0   0

In [82]:
df1 = df.reindex([0, "a"])
df1.shape

(2, 5)

In [85]:
df1

    이름    수학     국어    영어    음악
0   인욱  90.0  100.0  80.0  95.0
a  NaN   NaN    NaN   NaN   NaN

## 인덱스 & 컬럼 일부분 변경
- 기존 인덱스 / 컬럼에서 일부분 변경하는 메서드
- df.rename(index={기존:새}, columns={기존:새}, inplace=False)

In [89]:
# 수학 => MATE, 음악 => MUSIC 로 변경
df1 = df.rename(columns={"수학": "MATH", "음악": "MUSIC"})
df1

   이름  MATH   국어  영어  MUSIC
0  인욱    90  100  80     95
1  서준    80   91  85     85
2  동석    70   77  97     66
3  동석    80   50  20     77